{
  "format": "layers-model",
  "generatedBy": "keras v2.15.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "isl_gesture_mlp",
      "layers": [
        {
          "module": "keras.layers",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              63
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "input_1"
          },
          "registered_name": null
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": "float32",
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              63
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization",
            "trainable": true,
            "dtype": "float32",
            "axis": [
              1
            ],
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              128
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.3,
            "noise_shape": null,
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              128
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              128
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_1",
            "trainable": true,
            "dtype": "float32",
            "axis": [
              1
            ],
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.2,
            "noise_shape": null,
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": "float32",
            "units": 8,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              64
            ]
          }
        }
      ]
    },
    "keras_version": "2.15.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense/kernel",
          "shape": [
            63,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            128,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_mean",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_variance",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            64,
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            8
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}